inbox/EmacsLisp_Advising_Emacs_lisp_Functions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<!-- 2019-10-20 Sun 17:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Lisp 函数补丁</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu Peng" />
</head>
<body>
<div id="content">
<h1 class="title">Emacs Lisp 函数补丁</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org006639e">1. 补丁函数</a></li>
</ul>
</div>
</div>

<div id="outline-container-org006639e" class="outline-2">
<h2 id="org006639e"><span class="section-number-2">1</span> 补丁函数</h2>
<div class="outline-text-2" id="text-1">
<p>
当你需要修改定义在其他库中的函数，或者需要修改一个钩子，比如 `FOO-function'、过
滤器、变量或者其他存储函数值的对象时，你可以使用恰当的设置函数，比如`fset' 、
`defun' 设置命名函数，`setq' 设置钩子函数，`set-process-filter' 设置过滤器。但这
些都太笨了，因为将已有的值完全丢弃不用了。
</p>

<p>
"建议"功能可以让你使用“advising the function”为已经存在的函数添加一些功能，相
比重新定义整个函数，这是一个更加清洁的方式。
</p>

<p>
Emacs 的补丁系统提供了两套功能来做这事：核心的一种，用于变量或者对象域存储的函数
值（使用`add-function’ 和 `remove-function'），另一种是处于更高层的，用于命名函
数（使用 `advice-add' 和 `advice-remove'）。
</p>

<p>
例如：为了跟踪过滤器 PROC 的调用过程，你可以使用：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span><span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my-tracing-function</span> <span style="color: #7388d6;">(</span>proc string<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>message <span style="color: #8b2252;">"Proc %S received %S"</span> proc string<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">add-function</span> <span style="color: #483d8b;">:before</span> <span style="color: #7388d6;">(</span>process-filter PROC<span style="color: #7388d6;">)</span> #'my-tracing-function<span style="color: #707183;">)</span>
</pre>
</div>

<p>
这样，进程的输出会首先传给 `my-tracing-function'，然后再传给原来的过滤器。
`my-tracing-function' 收到的传入参数同原来的函数是一样的。完成后，你可以使用以下
代码恢复未被跟踪前的行为：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span><span style="color: #a020f0;">remove-function</span> <span style="color: #7388d6;">(</span>process-filter PROC<span style="color: #7388d6;">)</span> #'my-tracing-function<span style="color: #707183;">)</span>
</pre>
</div>

<p>
同样的，如果你想跟踪函数 `dispaly-buffer' 的运行，你可以使用：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span><span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">his-tracing-function</span> <span style="color: #7388d6;">(</span>orig-fun <span style="color: #228b22;">&amp;rest</span> args<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>message <span style="color: #8b2252;">"display-buffer called with args %S"</span> args<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>res <span style="color: #907373;">(</span>apply orig-fun args<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>message <span style="color: #8b2252;">"display-buffer returned %S"</span> res<span style="color: #909183;">)</span>
    res<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>advice-add 'display-buffer <span style="color: #483d8b;">:around</span> #'his-tracing-function<span style="color: #707183;">)</span>
</pre>
</div>

<p>
这里，`his-tracing-function' 会被使用原来的函数及其参数进行调用，所以，他可以在
需要的时候调用原来函数。当你已经尝试过看他的输出后，你可以使用如下方式恢复到未被
跟踪之前的状态：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span>advice-remove 'display-buffer #'his-tracing-function<span style="color: #707183;">)</span>
</pre>
</div>

<p>
前面两个例子中使用的参数 `:before' 和 `:around' 指定了两个函数如何组合，因为有许
多可选的方式。我们添加的函数也被称为 =补丁=。
</p>




<p>
本作品采用<a href="http://creativecommons.org/licenses/by-nc-nd/3.0/deed.zh">知识共享署名-非商业性使用-禁止演绎 3.0 未本地化版本许可协议</a> 进行许可。
</p>
</div>

<ol class="org-ol">
<li><a id="orgc426c04"></a>处理补丁的原语<br />
<div class="outline-text-3" id="text-1-1">
<p>
&#x2013; 宏： add-function where place function &amp;optional props
       这个宏是为存储在 PLACE 中的 FUNCTION 添加补丁的便捷方式（请参看
       Generializied Variables）。
</p>

<p>
WHERE 决定了 FUNCTION 是如何与已经存在的函数组合的，比如：FUNCTION 是在原
函数之前还是之后调用。请看 Advice combinators，了解可用组合方式。
</p>

<p>
当装饰一个变量（它的名字常常以 `-function' 结尾），你可以选择 FUNCTION 用
于全局还是仅仅当前缓冲区：如果 PLACE 只是符号， FUNCTION 将被添加到 PLACE
的全局值中。不论 PLACE 是像 `(local SYMBOL)'，还是返回变量名的表达式，
FUNCTION 都只会作用于当前缓冲区。最后，如果你想修饰字面变量，你必须使用
`(var VARIABLE)'。
</p>

<p>
每一个通过 `add-function' 添加的函数都可以附带一个属性列表 PROPS。目前只
有两个属性有特定意义：
</p>

<p>
`name'
      这个属性给补丁一个名字，`remove-function' 可以用来识别移除的函数，
      主要用在 FUNCTION 是匿名函数的情况。
</p>

<p>
`depth'
       这个属性定义如何给这个补丁排序，用于多个补丁的民政部。默认民政部下，
       其值为0。如果为100，则说明这个补丁应当被排在尽可以靠里的位置，
       而-100则表示应当被排在尽可能靠外的位置。当两个补丁有相同的深度值时，
       最近添加的处于最外层。
</p>

<p>
对于 `:before' 补丁，处于最外层是指这个补丁要在其他补丁运行前首先被运行，
而处于最里层，则指其在原函数被调用前运行，他和原函数之间没有其他要被运行
的补丁。同样的，对于 `:after' 补丁，最里层指其在原函数后立即执行，最外层
指在所有补丁的末尾执行。一个 `:override' 补丁只会覆盖原函数，而其他补丁
将会作用于新的函数上。
</p>

<p>
如果 FUNCTION 不是一个可交互的函数，重组之后的函数将继承其交互说明，如果有，
继承原函数的交互属性。否则，重组之后的函数，将是一个可交互的函数，使用新的交
互说明。有一个例外：如果 FUNCTION 的交互说明是一个函数（不是表达式或者字符
串），将会使用原函数的交互字符串作为一个参数调用这个函数，其结果作为重组的函
数的交互说明。可以使用 `advice-eval-interactive-spec' 来解析作为参数传递过来
的交互说明。
</p>

<p>
<b>注意</b>:FUNCTION 的交互说明将会作用于重组的函数，所以应当遵守重组函数的约定，
 而不是 FUNCTION。在许多案例中，这没有区别，因为两者是完全等价的，但在使用
 `:around'、`:filter-args' 和 `:filter-return' 方式时就不一样了，FUNCTION 接
 收原函数存放在 PLACE 中的参数就不同了。
</p>


<p>
&#x2013; 宏： remove-function place function
        这个宏将FUNCTION从PLACE中移除。这只对用 `add-function' 添加的FUNCTION有
        用。
</p>

<p>
FUNCTION 将会与加入到 PLACE 中的所有函数使用`equal' 进行对比，并且尝试与
lambda 表达式进行对比。 另外还会与加入 PLACE 的函数的 `name' 属性进行对比，
比使用 `equal' 与 lambda 表达式对比要可靠些。
</p>

<p>
&#x2013; 函数： advice-function-member-p advice function-def
          如果 ADVICE 已经在 FUNCTION-DEF 则返回 non-`nil'。同上面的
          `remove-function' 一样， ADVICE 除了可以是一个实际的函数，也可以是一个
          补丁片断的 `name'。
</p>

<p>
&#x2013; 函数： advice-function-mapc f function-def
   对添加到 FUNCTION-DEF 的所有的补丁应用函数 F。调用 F 函数时会传两个参数：补丁
   函数及其属性列表。
</p>

<p>
&#x2013; 函数： advice-eval-interactive-spec spec
    对一个交互说明求值，就像包含这样一个交互说明的函数执行过程一样，然后返回得到
    的参数列表。比如： `(advice-eval-interactive-spec "r\nP")' 将返回一个具有3个
    元素的列表，包括选区的前后边界和输入的前缀参数。
</p>
</div>
</li>

<li><a id="org8fb8937"></a>修补命名函数<br />
<div class="outline-text-3" id="text-1-2">
<p>
补丁通常用于命名函数和宏。你可能像这样使用 `add-function'：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span><span style="color: #a020f0;">add-function</span> <span style="color: #483d8b;">:around</span> <span style="color: #7388d6;">(</span>symbol-function 'FUN<span style="color: #7388d6;">)</span> #'his-tracing-function<span style="color: #707183;">)</span>
</pre>
</div>

<p>
但实际上在这种情况你应该用 `advice-add' 和 `advice-remove'。这对函数用于命名函数
的补丁，与 `add-function' 相比有以下特征：它们知道如何应对宏和自动加载
（autoloaded）的函数；让 `describe-function' 保持原函数和新加补厅的说明文档；在
函数重复定义前添加和移除补丁。
</p>

<p>
`advice-add' 可以在不重写整个函数的情况下修改已经存在函数的表现形式。但是，这也
可能是 bug 的来源，因为已经存在的调用者还假定基是原来的表现，当补丁修改函数表现
后，就可能工作不正常了。补丁还可能在调试中造成混乱，特别是调试者没有注意到或者不
记得这个函数已经被补丁修改过的时候。
</p>

<p>
因为这些原因，补丁应该被用在不使用其他方式个性函数表现形式的情况下。如果你可以用
钩子来做相同的事，应该优先选择钩子（请看钩子）。如果你只是简单想改变某个按键的行
为，你最好重写一个新的命令，将按键绑定的新命令上（请看 Remapping Commands）。
Emacs 自己的源文件不应该在 Emacs 的其他函数上加补丁。（当前有一些违背这条约定的例外，但我们准
备下步将其改掉。）
</p>

<p>
特殊语句（请看 Special Forms）不能加补丁，但宏可以加，像函数一样。当然，这不会影
响那些已经被宏展开的代码，所以，你要保证补丁在宏展开之前安装。
</p>

<p>
为原语加补丁也是可以的（请看 What Is a Function），但最好 <b>不要</b> 这样干，主要基
于两点考虑：一是有一些原语被用于补丁机制，为基加补丁可能造成死循环；二是许多原语
被C直接调用，这类调用不管补丁。因此，你可能因有些情况补丁有用（Lisp 代码），而有
些调用有没有用（C代码）而疯掉。
</p>

<p>
&#x2013; 宏： define-advice symol (where lambda-list &amp;optional name depth) &amp;rest body
    这个宏定义了一个补丁并将其添加到了名叫 SYMBOL 的函数。如果 NAME 为 `nil'，这
    个补丁是个匿名函数，或者名为 `symbol@name'。请看 `advice-add' 了解其他参数的
    解释。
</p>

<p>
&#x2013; 函数： advice-add symbol where function &amp;optional props
   将补丁 FUNCTION 添加到命名函数 SYMBOL。WHERE 和 PROPS 与 `add-function' 中的
   参数意义一样。
</p>

<p>
&#x2013; 函数： advice-remove symbol function
    从函数 SYMBOL 上移除补丁 FUNCTION。FUNCTION 同样可以是补丁的‘name’。
</p>

<p>
&#x2013; 函数： advice-member-p function symbol
    如果补丁 FUNCTION 已经被添加到了命名函数 SYMBOL 上了，则返回 non-'nil' 。FUNCTION 同样可以是补丁的‘name’。
</p>

<p>
&#x2013; 函数： advice-mapc function symbol
    对添加到命名函数 SYMBOL 上的所有补丁调用 FUNCTION，调用时传给两个参数：补丁
    函数及其所有属性。
</p>
</div>
</li>
