notes/000-Inbox-收集/EmacsLisp_Advising_Emacs_lisp_Functions.org
** 组装补丁的方式

以下是 `add-function' 和 `advice-add' 的 WHERE 参数的可选形式，指定补丁 FUNCTION
和原函数该如何组装。

`:before'
    在原函数之前调用 FUNCTION。两个函数收到的参数一样，新组合的返回值是原函数的
    返回值。更进一步说，新组合等同于下面这句：
#+begin_src emacs-lisp :tangle yes
          (lambda (&rest r) (apply FUNCTION r) (apply OLDFUN r))
#+end_src
    `(add-function :before FUNVAR FUNCTION)' 等同于单函数钩子 `(add-hook
    'HOOKVAR FUNCTION)'。

`:after'
    在原函数之后调用 FUNCTION。两个函数收到的参数一样，新组合的返回值是原函数的
    返回值。更进一步说，新组合等同于下面这句：
#+begin_src emacs-lisp :tangle yes
          (lambda (&rest r) (prog1 (apply OLDFUN r) (apply FUNCTION r)))
#+end_src
    `(add-function :after FUNVAR FUNCTION)' 等同于单函数钩子 `(add-hook
    'HOOKVAR FUNCTION 'append)'。

`:override'
    使用 FUNCTION 完全替换原函数。如果你使用 `remove-function' ，原函数还会被恢复。

`:around'
    调用 FUNCTION 而不是原函数，但将原函数作为 FUNCTION 的附加参数。这是最灵活的
    组合。比如，它允许你使用不同的参数调用原函数，或多次调用，或使用一个 let 绑
    定调用，或将完成的工作交给原函数，或完全替换他。更进一步讲，两个函数的组合等
    同于下面这句：
#+begin_src emacs-lisp :tangle yes
          (lambda (&rest r) (apply FUNCTION OLDFUN r))
#+end_src
    
`:before-while' 
    在原函数之前调用 FUNCTION，但如果 FUNCTION 返回值为 `nil' 则不再调用原函数。
    两个函数传入参数一样，新组合的返回值是原函数的返回值。更进一步讲，新组合等同
    于下面这句：
#+begin_src emacs-lisp :tangle yes
          (lambda (&rest r) (and (apply FUNCTION r) (apply OLDFUN r)))
#+end_src

      当 HOOKVAR 通过‘run-hook-with-args-until-failure’运行， ‘(add-function
      :before-while FUNVAR FUNCTION)’ 等同于单函数钩子‘(add-hook 'HOOKVAR
      FUNCTION)’。

`:before-until'
     在原函数之前调用 FUNCTION，但只当 FUNCTION 返回 `nil' 时才调用原函数。更进
     一步讲，新组合等同于下面这句：
#+begin_src emacs-lisp :tangle yes
          (lambda (&rest r) (or (apply FUNCTION r) (apply OLDFUN r)))
#+end_src

      当 HOOKVAR 通过‘run-hook-with-args-until-success’运行， ‘(add-function
      :before-untill FUNVAR FUNCTION)’ 等同于单函数钩子‘(add-hook 'HOOKVAR
      FUNCTION)’。

‘:after-while’
     在原函数返回 non-`nil' 才调用 FUNCTION。两个函数收到的参数一样，新组合的返
     回值是 FUNCTION 的返回值。更进一步讲，新组合等同于下面这句：
#+begin_src emacs-lisp :tangle yes
(lambda (&rest r) (and (apply OLDFUN r) (apply FUNCTION r)))
#+end_src

    当 HOOKVAR 通过 ‘run-hook-with-args-until-failure' 运行时，‘(add-function
     :after-while FUNVAR FUNCTION)’ 等同于单函数钩子 ‘(add-hook 'HOOKVAR FUNCTION 'append)’。

‘:after-until’
    先调用原函数，当其返回 `nil' 时，再调用 FUNCTION。更进一步讲，新组合等同于下
    面这句：
#+begin_src emacs-lisp :tangle yes
(lambda (&rest r) (or  (apply OLDFUN r) (apply FUNCTION r)))
#+end_src
    当 HOOKVAR 通过 ‘run-hook-with-args-until-success' 运行时，‘(add-function
     :after-until FUNVAR FUNCTION)’ 等同于 ‘(add-hook 'HOOKVAR FUNCTION 'append)’。     

‘:filter-args’
    先调用 FUNCTION，并将其返回值（列表）作为新的参数传给原函数。更进一步讲，新
    组合等同于下面这句：
#+begin_src emacs-lisp :tangle yes
(lambda (&rest r) (apply OLDFUN (funcall FUNCTION r)))
#+end_src

‘:filter-return’
    先调用原函数，然后将其返回值作为参数传给 FUNCTION。更进一步讲，新组合等同于
    下面这句：
#+begin_src emacs-lisp :tangle yes
(lambda (&rest r) (funcall FUNCTION (apply OLDFUN r)))
#+end_src

