notes/000-Inbox-收集/EmacsLisp_Advising_Emacs_lisp_Functions.org
** 适配原 defadvice

许多代码用的原来的 `defadvice' 机制，已经被新的 `advice-add' 替代了。原来的实现
和语法要更简单。

老的补丁片断像这样：

#+begin_src emacs-lisp :tangle yes
     (defadvice previous-line (before next-line-at-end
                                      (&optional arg try-vscroll))
       "Insert an empty line when moving up from the top line."
       (if (and next-line-add-newlines (= arg 1)
                (save-excursion (beginning-of-line) (bobp)))
           (progn
             (beginning-of-line)
             (newline))))
#+end_src

可以按新的补丁机制转换成普通函数：

#+begin_src emacs-lisp :tangle yes
     (defun previous-line--next-line-at-end (&optional arg try-vscroll)
       "Insert an empty line when moving up from the top line."
       (if (and next-line-add-newlines (= arg 1)
                (save-excursion (beginning-of-line) (bobp)))
           (progn
             (beginning-of-line)
             (newline))))
#+end_src

很显然，这实际上没有修改 `previous-line' 。原补丁还需要：

#+begin_src emacs-lisp :tangle yes
     (ad-activate 'previous-line)
#+end_src

而新的补丁机制需要：

#+begin_src emacs-lisp :tangle yes
     (advice-add 'previous-line :before #'previous-line--next-line-at-end)
#+end_src

*注意* `ad-activate' 具有全局效果：它将指定函数的所有的补丁都激活。如果你只想激
活或者停止某一个补丁，则需要使用 `ad-enable-advice' 和 `ad-disable-advice' 来使
用或者禁止它。 新机制没有这个限制。

像这样的包围装饰补丁：

#+begin_src emacs-lisp :tangle yes
     (defadvice foo (around foo-around)
       "Ignore case in `foo'."
       (let ((case-fold-search t))
         ad-do-it))
     (ad-activate 'foo)
#+end_src

可以像这样转换：

#+begin_src emacs-lisp :tangle yes
     (defun foo--foo-around (orig-fun &rest args)
       "Ignore case in `foo'."
       (let ((case-fold-search t))
         (apply orig-fun args)))
     (advice-add 'foo :around #'foo--foo-around)
#+end_src

关于补丁的 =class= ，注意 新的 `:before' 与老的 `before' 不完全相同，因为老的补
丁中你可以修改函数的参数（比如：使用 `ad-set-arg'），这会影响原函数得到的参数。
而新的 `:before'，在补丁中通过 `setq' 修改参数对原函数看到的参数没有影响。当移植
带有 `before' 的如前所述的补丁时，你需要将其转换为 `:around' 或者 `:filter-args'
补丁。

同样的，老的 `after' 补丁可能通过修改 `ad-return-value' 影响最后的返回值，而新的
`:after' 补丁不会，所以，当你移植这样的老的 `after' 补丁时，则需要将其转换为
`:around' 或者 `:filter-return' 补丁。

** 修补结果

#+begin_src emacs-lisp :tangle yes
defun avy--generic-jump-around-advice (orig-fun &rest args)
  "针对 `ace-pinyin-jump-char' 及 `ace-pinyin-jump-char-2' 的修补
函数。判断传入的第3个参数是否是数字，如果是则原样调用原函数，否则，
截取前2个参数调用原函数。"
  (if  (number-or-marker-p (car (nthcdr 2 args)))
      (apply orig-fun args)
      (apply orig-fun (butlast args (- (length args) 2)))
      ))

(if (not  (advice-member-p 'avy--generic-jump-around-advice 'avy--generic-jump) )
    ( advice-add 'avy--generic-jump :around #'avy--generic-jump-around-advice ))

(global-set-key (kbd "M-g") 'ace-pinyin-jump-char-2)

#+end_src

至此，可以输入两个字母来定位到汉字或者英文。

本作品采用[[http://creativecommons.org/licenses/by-nc-nd/3.0/deed.zh][知识共享署名-非商业性使用-禁止演绎 3.0 未本地化版本许可协议]] 进行许可。