inbox/EmacsLisp_Advising_Emacs_lisp_Functions.html

<li><a id="org867ecf2"></a>适配原 defadvice<br />
<div class="outline-text-3" id="text-1-4">
<p>
许多代码用的原来的 `defadvice' 机制，已经被新的 `advice-add' 替代了。原来的实现
和语法要更简单。
</p>

<p>
老的补丁片断像这样：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span><span style="color: #a020f0;">defadvice</span> <span style="color: #0000ff;">previous-line</span> <span style="color: #7388d6;">(</span>before next-line-at-end
                                 <span style="color: #909183;">(</span><span style="color: #228b22;">&amp;optional</span> arg try-vscroll<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #8b2252;">"Insert an empty line when moving up from the top line."</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span><span style="color: #a020f0;">and</span> next-line-add-newlines <span style="color: #709870;">(</span>= arg 1<span style="color: #709870;">)</span>
           <span style="color: #709870;">(</span><span style="color: #a020f0;">save-excursion</span> <span style="color: #907373;">(</span>beginning-of-line<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>bobp<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span><span style="color: #a020f0;">progn</span>
        <span style="color: #709870;">(</span>beginning-of-line<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>newline<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
可以按新的补丁机制转换成普通函数：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span><span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">previous-line--next-line-at-end</span> <span style="color: #7388d6;">(</span><span style="color: #228b22;">&amp;optional</span> arg try-vscroll<span style="color: #7388d6;">)</span>
  <span style="color: #8b2252;">"Insert an empty line when moving up from the top line."</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span><span style="color: #a020f0;">and</span> next-line-add-newlines <span style="color: #709870;">(</span>= arg 1<span style="color: #709870;">)</span>
           <span style="color: #709870;">(</span><span style="color: #a020f0;">save-excursion</span> <span style="color: #907373;">(</span>beginning-of-line<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>bobp<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span><span style="color: #a020f0;">progn</span>
        <span style="color: #709870;">(</span>beginning-of-line<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>newline<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
很显然，这实际上没有修改 `previous-line' 。原补丁还需要：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span>ad-activate 'previous-line<span style="color: #707183;">)</span>
</pre>
</div>

<p>
而新的补丁机制需要：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span>advice-add 'previous-line <span style="color: #483d8b;">:before</span> #'previous-line--next-line-at-end<span style="color: #707183;">)</span>
</pre>
</div>

<p>
<b>注意</b> `ad-activate' 具有全局效果：它将指定函数的所有的补丁都激活。如果你只想激
活或者停止某一个补丁，则需要使用 `ad-enable-advice' 和 `ad-disable-advice' 来使
用或者禁止它。 新机制没有这个限制。
</p>

<p>
像这样的包围装饰补丁：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span><span style="color: #a020f0;">defadvice</span> <span style="color: #0000ff;">foo</span> <span style="color: #7388d6;">(</span>around foo-around<span style="color: #7388d6;">)</span>
  <span style="color: #8b2252;">"Ignore case in `</span><span style="color: #008b8b;">foo</span><span style="color: #8b2252;">'."</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>case-fold-search t<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    ad-do-it<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>ad-activate 'foo<span style="color: #707183;">)</span>
</pre>
</div>

<p>
可以像这样转换：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span><span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">foo--foo-around</span> <span style="color: #7388d6;">(</span>orig-fun <span style="color: #228b22;">&amp;rest</span> args<span style="color: #7388d6;">)</span>
  <span style="color: #8b2252;">"Ignore case in `</span><span style="color: #008b8b;">foo</span><span style="color: #8b2252;">'."</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>case-fold-search t<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>apply orig-fun args<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>advice-add 'foo <span style="color: #483d8b;">:around</span> #'foo--foo-around<span style="color: #707183;">)</span>
</pre>
</div>

<p>
关于补丁的 <code>class</code> ，注意 新的 `:before' 与老的 `before' 不完全相同，因为老的补
丁中你可以修改函数的参数（比如：使用 `ad-set-arg'），这会影响原函数得到的参数。
而新的 `:before'，在补丁中通过 `setq' 修改参数对原函数看到的参数没有影响。当移植
带有 `before' 的如前所述的补丁时，你需要将其转换为 `:around' 或者 `:filter-args'
补丁。
</p>

<p>
同样的，老的 `after' 补丁可能通过修改 `ad-return-value' 影响最后的返回值，而新的
`:after' 补丁不会，所以，当你移植这样的老的 `after' 补丁时，则需要将其转换为
`:around' 或者 `:filter-return' 补丁。
</p>
</div>
</li>
</ol>
</div>
</div>
</body>
</html>